Repository: vishal-rivi/rivi-askai-ios
Catalog: Sources/RiviAskAI/Resources/*.lproj/Localizable.strings
Languages: ar

# ask_ai_button_text
source: Ask AI
ar: اسأل الذكاء الاصطناعي

# ask_ai_sheet_title
source: Ask AI
ar: اسأل الذكاء الاصطناعي

# ask_ai_sheet_placeholder_hotel
source: e.g. 4 star hotels near the airport with free breakfast
ar: مثال: فنادق 4 نجوم بالقرب من المطار مع إفطار مجاني

# ask_ai_sheet_placeholder_flight
source: e.g. Direct flights that reach before 4PM with meals included
ar: مثال: رحلات مباشرة تصل قبل الساعة 4 مساءً مع وجبات

# ask_ai_sheet_submit_button
source: Improve Results
ar: تحسين النتائج

# ask_ai_sheet_tooltip_hotel
source: AI intelligently sorts hotels to prioritize your preferences - without filtering results.
ar: يقوم الذكاء الاصطناعي بترتيب الفنادق بذكاء لإعطاء الأولوية لتفضيلاتك - دون تصفية النتائج.

# ask_ai_sheet_tooltip_flight
source: AI intelligently sorts flights to prioritize your preferences - without filtering results.
ar: يقوم الذكاء الاصطناعي بترتيب الرحلات بذكاء لإعطاء الأولوية لتفضيلاتك - دون تصفية النتائج.

# info_banner_title
source: AI-sorted results
ar: نتائج مرتبة بالذكاء الاصطناعي

# info_banner_description
source: Results are intelligently sorted based on your preferences
ar: يتم ترتيب النتائج بذكاء بناءً على تفضيلاتك

# alert_dialog_title
source: Parameter Change Detected
ar: تم اكتشاف تغيير في المعاملات

# alert_dialog_description
source: Your prompt includes changes to trip details. To update trip details, use the search fields above.
ar: يتضمن طلبك تغييرات في تفاصيل الرحلة. لتحديث تفاصيل الرحلة، استخدم حقول البحث أعلاه.

# alert_dialog_button
source: Got it
ar: حسناً

# parameter_change_warning_title
source: Your prompt includes changes to trip details
ar: يتضمن طلبك تغييرات في تفاصيل الرحلة

# parameter_change_warning_description
source: To update trip details, use the search fields above.
ar: لتحديث تفاصيل الرحلة، استخدم حقول البحث أعلاه.

# clear_query_dialog_title
source: Clear Ask AI Query
ar: مسح استعلام الذكاء الاصطناعي

# clear_query_dialog_description
source: Your active query will be cleared in order to change the sorting. Do you wish to proceed?
ar: سيتم مسح استعلامك النشط لتغيير الترتيب. هل تريد المتابعة؟

# clear_query_dialog_cancel
source: Back
ar: رجوع

# clear_query_dialog_confirm
source: Proceed
ar: متابعة
